---
kind: other
id: Properties.T:Autodesk.Revit.DB.DetailNurbSpline
source: html/71977151-eb42-6fef-790d-74357e8256da.htm
---
# DetailNurbSpline Properties

The id of the assembly instance to which the element belongs.